zlgopen/ametal/soc/hdsc/drivers/include/adtim/hw/amhw_hc32_adtim.h
    p_hw_adtim->hcupr = 0;

    return AM_TRUE;
}

/**
 * \brief 配置硬件递减事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] choice     : amhw_hc32_adtim_hw_cnt_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_cfghwcntdown(amhw_hc32_adtim_t       *p_hw_adtim,
                                         amhw_hc32_adtim_hw_cnt_t choice) {
    if(choice > AMHW_HC32_ADTIM_HwCntAos3) {
        return AM_FALSE;
    }

    p_hw_adtim->hcdor |= (1ul << choice);

    return AM_TRUE;
}

/**
 * \brief 清除硬件递减事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearhwcntdown(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hcdor = 0;

    return AM_TRUE;
}

/**
 * \brief 配置硬件启动事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] choice     : amhw_hc32_adtim_hw_trig_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_cfghwstart(amhw_hc32_adtim_t        *p_hw_adtim,
                                       amhw_hc32_adtim_hw_trig_t choice) {
    if(choice > AMHW_HC32_ADTIM_HwTrigTimTriDFall) {
        return AM_FALSE;
    }

    p_hw_adtim->hstar |= (1ul << choice);

    return AM_TRUE;
}

/**
 * \brief 清除硬件启动事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearhwstart(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hstar = 0;

    return AM_TRUE;
}

/**
 * \brief 使能硬件启动事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_enablehwstart(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hstar |= (1ul << 31);

    return AM_TRUE;
}

/**
 * \brief 禁止硬件启动事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_disablehwstart(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hstar &= ~(1ul << 31);

    return AM_TRUE;
}

/**
 * \brief 配置硬件停止事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] choice     : amhw_hc32_adtim_hw_trig_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_cfghwstop(amhw_hc32_adtim_t        *p_hw_adtim,
                                      amhw_hc32_adtim_hw_trig_t choice) {

    if(choice > AMHW_HC32_ADTIM_HwTrigTimTriDFall) {
        return AM_FALSE;
    }

    p_hw_adtim->hstpr |= (1ul << choice);

    return AM_TRUE;
}

/**
 * \brief 清除硬件停止事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearhwstop(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hstpr = 0;

    return AM_TRUE;
}

/**
 * \brief 使能硬件停止事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_enablehwstop(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hstpr |= (1ul << 31);

    return AM_TRUE;
}

/**
 * \brief 禁止硬件停止事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_disablehwstop(amhw_hc32_adtim_t *p_hw_adtim){

    p_hw_adtim->hstpr &= ~(1ul << 31);

    return AM_TRUE;
}

/**
 * \brief 配置硬件清零事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] choice     : amhw_hc32_adtim_hw_trig_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_cfghwclear(amhw_hc32_adtim_t        *p_hw_adtim,
                                       amhw_hc32_adtim_hw_trig_t choice) {

    if(choice > AMHW_HC32_ADTIM_HwTrigTimTriDFall) {
        return AM_FALSE;
    }

    p_hw_adtim->hcelr |= (1ul << choice);

    return AM_TRUE;
}

/**
 * \brief 清除硬件清零事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearhwclear(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hcelr = 0;

    return AM_TRUE;
}

/**
 * \brief 使能硬件清零事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_enablehwclear(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hcelr |= (1ul << 31);

    return AM_TRUE;
}

/**
 * \brief 禁止硬件清零事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_disablehwclear(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hcelr &= ~(1ul << 31);

    return AM_TRUE;
}

/**
 * \brief 配置A通道硬件捕获事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] choice     : amhw_hc32_adtim_hw_trig_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_cfghwcaptureA(amhw_hc32_adtim_t        *p_hw_adtim,
                                          amhw_hc32_adtim_hw_trig_t choice) {

    if(choice > AMHW_HC32_ADTIM_HwTrigTimTriDFall) {
        return AM_FALSE;
    }

    p_hw_adtim->hcpar |= (1ul << choice);
    p_hw_adtim->pconr |= (1ul << 0 );

    return AM_TRUE;
}

/**
 * \brief 清除A通道硬件捕获事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearhwcaptureA(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hcpar = 0;

    return AM_TRUE;
}

/**
 * \brief 配置B通道硬件捕获事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] choice     : amhw_hc32_adtim_hw_trig_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_cfghwcaptureB(amhw_hc32_adtim_t        *p_hw_adtim,
                                          amhw_hc32_adtim_hw_trig_t choice) {

    if(choice > AMHW_HC32_ADTIM_HwTrigTimTriDFall) {
        return AM_FALSE;
    }

    p_hw_adtim->hcpbr |= (1ul << choice);
    p_hw_adtim->pconr |= (1ul << 16 );

    return AM_TRUE;
}

/**
 * \brief 清除B通道硬件捕获事件
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearhwcaptureB(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->hcpbr = 0;

    return AM_TRUE;
}

/**
 * \brief 软件同步启动
 *
 * \param[in] p_cfg : 指向ADT软件同步配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_swsyncstart(amhw_hc32_adtim_sw_sync_t *p_cfg) {

    if(p_cfg->adtim4) {
        ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->sstar = (1ul << 0);
    }

    if(p_cfg->adtim5) {
        ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->sstar = (1ul << 1);
    }

