zlgopen/ametal/soc/hdsc/drivers/include/adtim/hw/amhw_hc32_adtim.h
    if(p_cfg->adtim6) {
        ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->sstar = (1ul << 2);
    }

    return AM_TRUE;
}

/**
 * \brief 软件同步停止
 *
 * \param[in] p_cfg : 指向ADT软件同步配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_swsyncstop(amhw_hc32_adtim_sw_sync_t *p_cfg) {

    if(p_cfg->adtim4) {
        ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->sstpr = (1ul << 0);
    }
    if(p_cfg->adtim5) {
        ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->sstpr = (1ul << 1);
    }
    if(p_cfg->adtim6) {
        ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->sstpr = (1ul << 2);
    }

    return AM_TRUE;
}

/**
 * \brief 软件同步清零
 *
 * \param[in] p_cfg : 指向ADT软件同步配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_swsyncclear(amhw_hc32_adtim_sw_sync_t *p_cfg) {

    if(p_cfg->adtim4) {
        ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->sclrr = (1ul << 0);
    }
    if(p_cfg->adtim5) {
        ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->sclrr = (1ul << 1);
    }
    if(p_cfg->adtim6) {
        ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->sclrr = (1ul << 2);
    }

    return AM_TRUE;
}

/**
 * \brief 获取软件同步状态
 *
 * \param[in] p_cfg : 指向ADT软件同步配置结构体的指针
 *
 * \return AM_FALSE ：获取失败
 *         AM_TRUE  ：获取成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_setswsyncstate(amhw_hc32_adtim_sw_sync_t *p_cfg) {

    amhw_hc32_adtim_t *p_hw_adtim4 = (amhw_hc32_adtim_t *)HC32_TIM4_BASE;

    p_cfg->adtim4 = (p_hw_adtim4->sstar >> 0) & 1ul ? AM_TRUE : AM_FALSE;
    p_cfg->adtim5 = (p_hw_adtim4->sstar >> 1) & 1ul ? AM_TRUE : AM_FALSE;
    p_cfg->adtim6 = (p_hw_adtim4->sstar >> 2) & 1ul ? AM_TRUE : AM_FALSE;

    return AM_TRUE;
}

/**
 * \brief AOS触发配置
 *
 * \param[in] p_cfg : 指向AOS触发配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_aostrigcfg(amhw_hc32_adtim_aos_trig_cfg_t *p_cfg){

    amhw_hc32_adtim_t *p_hw_adtim4 = (amhw_hc32_adtim_t *)HC32_TIM4_BASE;

    if(p_cfg == NULL) {
        return AM_FALSE;
    }

    p_hw_adtim4->itrig  = 0;
    p_hw_adtim4->itrig |= (p_cfg->aos0trig_src << 0);
    p_hw_adtim4->itrig |= (p_cfg->aos1trig_src << 4);
    p_hw_adtim4->itrig |= (p_cfg->aos2trig_src << 8);
    p_hw_adtim4->itrig |= (p_cfg->aos3trig_src << 12);

    return AM_TRUE;
}

/**
 * \brief 中断触发使能配置
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] p_cfg      : 指向中断使能配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_bool_t amhw_hc32_adtim_irqtrigcfg(
              amhw_hc32_adtim_t              *p_hw_adtim,
              amhw_hc32_adtim_irq_trig_cfg_t *p_cfg);

/**
 * \brief 端口触发配置
 *
 * \param[in] trigport : amhw_hc32_adtim_trig_port_t端口枚举量
 * \param[in] p_cfg    : 指向端口配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_bool_t amhw_hc32_adtim_porttrigcfg(
              amhw_hc32_adtim_trig_port_t      trigport,
              amhw_hc32_adtim_port_trig_cfg_t *p_cfg);

/**
 * \brief CHxX端口配置
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] port       : amhw_hc32_adtim_chx_t通道枚举量
 * \param[in] p_cfg      : 指向TIMxX端口配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_bool_t amhw_hc32_adtim_timxchxportcfg(
              amhw_hc32_adtim_t                   *p_hw_adtim,
              amhw_hc32_adtim_chx_t                port,
              amhw_hc32_adtim_timx_chx_port_cfg_t *p_cfg);

/**
 * \brief 使能端口刹车
 *
 * \param[in] port       : 端口编号（0~15）
 * \param[in] p_cfg      : 指向TADT刹车端口配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_enablebrakeport(
              uint8_t                             port,
              amhw_hc32_adtim_break_port_cfg_t *p_cfg) {

    amhw_hc32_adtim_t *p_hw_adtim4 = (amhw_hc32_adtim_t *)HC32_TIM4_BASE;

    if(p_cfg == NULL) {
        return AM_FALSE;
    }

    p_hw_adtim4->ptbkp &= ~(1ul << port);
    p_hw_adtim4->ptbkp |= (p_cfg->polaritysel << port);
    p_hw_adtim4->ptbks |= (1ul << port);

    return AM_TRUE;
}

/**
 * \brief 清除端口刹车
 */
am_static_inline
void amhw_hc32_adtim_clearbrakeport(void) {

    ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->ptbks = 0;
}

/**
 * \brief 无效条件3配置(端口刹车)
 *
 * \param[in] p_cfg      : 指向TADT无效条件3配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_bool_t amhw_hc32_adtim_disable3cfg(
              amhw_hc32_adtim_disable_3_cfg_t *p_cfg);

/**
 * \brief 软件刹车 Enable/Disable(仅适用于无效条件3使能的情况下)
 *
 * \param[in] flag      : AM_FALSE(禁能) 或       AM_TRUE(使能)
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_swbrake(am_bool_t flag) {

    amhw_hc32_adtim_t *p_hw_adtim4 = (amhw_hc32_adtim_t *)HC32_TIM4_BASE;

    p_hw_adtim4->aossr &= ~(1ul << 7);
    p_hw_adtim4->aossr |= (flag << 7);

    return AM_TRUE;
}

/**
 * \brief 获取端口刹车标志
 *
 * \return AM_FALSE ：禁能状态
 *         AM_TRUE  ：使能状态
 */
am_static_inline
am_bool_t amhw_hc32_adtim_getportbrakeflag(void) {
    return ((((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->aossr >> 0) & 1ul) ?
           AM_TRUE :
           AM_FALSE;
}

/**
 * \brief 清除端口刹车标志
 *
 */
am_static_inline
void amhw_hc32_adtim_clearportbrakeflag(void) {

    ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->aoscl &= ~(1ul << 0);
}

/**
 * \brief 无效条件1配置(同高同低刹车)
 *
 * \param[in] p_cfg : 指向TADT无效条件1配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_disable1Cfg(
              amhw_hc32_adtim_disable_1_cfg_t *p_cfg) {

    amhw_hc32_adtim_t *p_hw_adtim4 = (amhw_hc32_adtim_t *)HC32_TIM4_BASE;

    if(p_cfg == NULL) {
        return AM_FALSE;
    }

    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 13))) |
                         (p_cfg->tim6_outsh << 13);
    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 12))) |
                         (p_cfg->tim5_outsh << 12);
    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 11))) |
                         (p_cfg->tim4_outsh << 11);
    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 10))) |
                         (p_cfg->tim6_outsl << 10);
    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 9))) |
                         (p_cfg->tim5_outsl << 9);
    p_hw_adtim4->aossr = (p_hw_adtim4->aossr & (~(1ul << 8))) |
                         (p_cfg->tim4_outsl << 8);

    return AM_TRUE;
}

/**
 * \brief 获取同高同低刹车标志
 *
 * \return AM_FALSE ：0
 *         AM_TRUE  ：1
 */
am_static_inline
am_bool_t amhw_hc32_adtim_getsamebrakeflag(void) {
    return ((((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->aossr >> 1) & 1ul) ?
           AM_TRUE :
           AM_FALSE;
}

/**
 * \brief 清除同高同低刹车标志
 *
 */
am_static_inline
void amhw_hc32_adtim_clearsamebrakeflag(void) {
    ((amhw_hc32_adtim_t *)HC32_TIM4_BASE)->aoscl &= ~(1ul << 1);
}

/**
 * \brief PWM展频配置
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] p_cfg      : 指向PWM展频计数配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_pwmdithercfg(
              amhw_hc32_adtim_t                *p_hw_adtim,
              amhw_hc32_adtim_pwm_dither_cfg_t *p_cfg) {
    if(p_cfg == NULL) {
        return AM_FALSE;
    }

    p_hw_adtim->cr = (p_hw_adtim->cr & (~(1ul << 10))) |
                     (p_cfg->enAMHW_HC32_ADTIM_PDType << 10);
    p_hw_adtim->cr = (p_hw_adtim->cr & (~(1ul << 9))) |
                     (p_cfg->bTimxBPDEn << 9);
    p_hw_adtim->cr = (p_hw_adtim->cr & (~(1ul << 8))) |
                     (p_cfg->bTimxAPDEn << 8);

    return AM_TRUE;
}

/**
 * \brief ADTIM初始化
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] p_cfg      : 指向ADT基本计数配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_init(amhw_hc32_adtim_t             *p_hw_adtim,
                                 amhw_hc32_adtim_basecnt_cfg_t *p_cfg) {
    if(p_cfg == NULL) {
        return AM_FALSE;
    }

