zlgopen/ametal/soc/hdsc/drivers/include/adtim/hw/amhw_hc32_adtim.h
    if((p_cfg->cntmode) > AMHW_HC32_ADTIM_CNT_MODE_TRIANGLE_B) {
        return AM_FALSE;
    }

    p_hw_adtim->gconr &= ~(7ul << 1);
    p_hw_adtim->gconr &= ~(7ul << 4);
    p_hw_adtim->gconr &= ~(1ul << 8);

    p_hw_adtim->gconr |= (p_cfg->cntmode << 1);
    p_hw_adtim->gconr |= (p_cfg->cntclkdiv << 4);
    p_hw_adtim->gconr |= (p_cfg->cntdir << 8);

    return AM_TRUE;
}

am_static_inline
amhw_hc32_adtim_pclk_div_t
amhw_hc32_adtim_clkdiv_get(amhw_hc32_adtim_t *p_hw_adtim) {

    return (amhw_hc32_adtim_pclk_div_t)((p_hw_adtim->gconr >> 4) & 7ul);
}


/**
 * \brief ADTIM去初始化
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_bool_t amhw_hc32_adtim_deinit(amhw_hc32_adtim_t *p_hw_adtim);

/**
 * \brief ADTIM启动
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_startcount(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->gconr |= (1ul << 0);

    return AM_TRUE;
}

/**
 * \brief ADTIM停止
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_stopcount(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->gconr &= ~(1ul << 0);

    return AM_TRUE;
}

/**
 * \brief 设置计数值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] cnt        ： 计数值设定
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_setcount(amhw_hc32_adtim_t *p_hw_adtim,
                                     uint16_t             cnt) {

    p_hw_adtim->cnter = cnt;

    return AM_TRUE;
}

/**
 * \brief 获取计数值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return 计数值
 */
am_static_inline
uint16_t amhw_hc32_adtim_getcount(amhw_hc32_adtim_t *p_hw_adtim) {
    return p_hw_adtim->cnter;
}

/**
 * \brief 清除计数值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearcount(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->cnter = 0;

    return AM_TRUE;
}

/**
 * \brief 获取有效周期计数值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return 有效周期计数值
 */
am_static_inline
uint8_t amhw_hc32_adtim_getvpernum(amhw_hc32_adtim_t *p_hw_adtim) {
    return ((p_hw_adtim->stflr >> 21) & 0x7ul);
}

/**
 * \brief 获取状态标志
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] type       : amhw_hc32_adtim_state_type_t状态标志枚举量
 *
 * \return AM_FALSE ：标志无效
 *         AM_TRUE  ：标志有效
 */
am_static_inline
am_bool_t amhw_hc32_adtim_getstate(amhw_hc32_adtim_t           *p_hw_adtim,
                                     amhw_hc32_adtim_state_type_t type) {
    return ((p_hw_adtim->stflr >> type) & 1ul) ? AM_TRUE : AM_FALSE;
}

/**
 * \brief 配置计数周期
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] data       : 计数周期设定值
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_setperiod(amhw_hc32_adtim_t *p_hw_adtim,
                                      uint16_t             data) {

    p_hw_adtim->perar = data;

    return AM_TRUE;
}

/**
 * \brief 获取计数周期
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return 计数周期
 */
am_static_inline
uint16_t amhw_hc32_adtim_getperiod(amhw_hc32_adtim_t *p_hw_adtim) {

    return p_hw_adtim->perar;
}

/**
 * \brief 配置计数周期缓冲
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] data       : 周期缓冲设定值
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_setperiodbuf(amhw_hc32_adtim_t *p_hw_adtim,
                                         uint16_t             data) {
    p_hw_adtim->perbr  = data;
    p_hw_adtim->bconr |= (1ul << 8);

    return AM_TRUE;
}

/**
 * \brief 清除计数周期缓冲
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearperiodbuf(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->bconr &= ~(1ul << 8);
    p_hw_adtim->perbr  = 0;

    return AM_TRUE;
}

/**
 * \brief 配置有效计数周期
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] p_cfg      : 指向ADT有效计数周期配置结构体的指针
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_setvalidperiod(
              amhw_hc32_adtim_t              *p_hw_adtim,
              amhw_hc32_adtim_validper_cfg_t *p_cfg) {
    if(p_cfg == NULL) {
        return AM_FALSE;
    }

    p_hw_adtim->vperr  = 0;
    p_hw_adtim->vperr |= (p_cfg->validcnt << 18);
    p_hw_adtim->vperr |= (p_cfg->validcdt << 16);
    p_hw_adtim->vperr |= (p_cfg->period_D << 3);
    p_hw_adtim->vperr |= (p_cfg->period_C << 2);
    p_hw_adtim->vperr |= (p_cfg->period_B << 1);
    p_hw_adtim->vperr |= (p_cfg->period_A << 0);

    return AM_TRUE;
}

/**
 * \brief 配置比较输出计数基准值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] compare    : amhw_hc32_adtim_compare_x_t枚举量
 * \param[in] data       : 设定值
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_setcomparevalue(
              amhw_hc32_adtim_t          *p_hw_adtim,
              amhw_hc32_adtim_compare_x_t compare,
              uint16_t                      data) {

    switch(compare) {
    case AMHW_HC32_ADTIM_COMPARE_A:
        p_hw_adtim->gcmxr[0] = data;
        break;
    case AMHW_HC32_ADTIM_COMPARE_B:
        p_hw_adtim->gcmxr[1] = data;
        break;
    case AMHW_HC32_ADTIM_COMPARE_C:
        p_hw_adtim->gcmxr[2] = data;
        break;
    case AMHW_HC32_ADTIM_COMPARE_D:
        p_hw_adtim->gcmxr[3] = data;
        break;
    default:
        return AM_FALSE;
    }

    return AM_TRUE;
}

/**
 * \brief 配置专用比较计数基准值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] compare    : amhw_hc32_adtim_special_compare_x_t枚举量
 * \param[in] data       : 设定值
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_setspecilcomparevalue(
              amhw_hc32_adtim_t                  *p_hw_adtim,
              amhw_hc32_adtim_special_compare_x_t compare,
              uint16_t                              data) {
    switch(compare) {
    case AMHW_HC32_ADTIM_SPCL_COMP_A:
        p_hw_adtim->scmxr[0] = data;
        break;
    case AMHW_HC32_ADTIM_SPCL_COMP_B:
        p_hw_adtim->scmxr[1] = data;
        break;
    default:
        return AM_FALSE;
    }

    return AM_TRUE;
}

/**
 * \brief 配置通用比较值/捕获值的缓存传送
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] compare    : amhw_hc32_adtim_chx_t枚举量
 * \param[in] enable     : 使能状态（AM_FALSE或AM_TRUE）
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_enablevaluebuf(amhw_hc32_adtim_t    *p_hw_adtim,
                                           amhw_hc32_adtim_chx_t port,
                                           am_bool_t               enable) {
    switch(port) {
    case AMHW_HC32_ADTIM_CHX_A:
        p_hw_adtim->bconr = (p_hw_adtim->bconr & (~(1ul << 0))) |
                            (enable << 0);
        break;
    case AMHW_HC32_ADTIM_CHX_B:
        p_hw_adtim->bconr = (p_hw_adtim->bconr & (~(1ul << 2))) |
                            (enable << 2);
        break;
    default:
        return AM_FALSE;
    }

    return AM_TRUE;
}

/**
 * \brief 清除比较输出计数值/捕获值缓存
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] port       : amhw_hc32_adtim_chx_t枚举量
 *
 * \return AM_FALSE ：设置失败
 *         AM_TRUE  ：设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearvaluebuf(amhw_hc32_adtim_t    *p_hw_adtim,
                                          amhw_hc32_adtim_chx_t port) {
    switch(port) {
    case AMHW_HC32_ADTIM_CHX_A:
        p_hw_adtim->gcmxr[2] = 0;
        break;
    case AMHW_HC32_ADTIM_CHX_B:
        p_hw_adtim->gcmxr[3] = 0;
        break;
    default:
        return AM_FALSE;
    }

    return AM_TRUE;
}

/**
 * \brief 获取捕获值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] port       : amhw_hc32_adtim_chx_t枚举量
 *
 * \return 捕获值
 */
am_static_inline
uint16_t amhw_hc32_adtim_getcapturevalue(amhw_hc32_adtim_t    *p_hw_adtim,
                                           amhw_hc32_adtim_chx_t port) {
    switch(port) {
    case AMHW_HC32_ADTIM_CHX_A:
        return p_hw_adtim->gcmxr[0];
    case AMHW_HC32_ADTIM_CHX_B:
        return p_hw_adtim->gcmxr[1];
    default:
        return AM_FALSE;
    }
}

/**
 * \brief 获取捕获缓存值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] port       : amhw_hc32_adtim_chx_t枚举量
 *
 * \return 捕获缓存值
 */
am_static_inline
uint16_t amhw_hc32_adtim_getcapturebuf(amhw_hc32_adtim_t     *p_hw_adtim,
                                          amhw_hc32_adtim_chx_t port) {
    switch(port) {
    case AMHW_HC32_ADTIM_CHX_A:
        return p_hw_adtim->gcmxr[2];
    case AMHW_HC32_ADTIM_CHX_B:
        return p_hw_adtim->gcmxr[3];
    default:
        return AM_FALSE;
    }
}

/**
 * \brief 设置死区时间上基准值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] data       : 设定值
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_setdtua(amhw_hc32_adtim_t *p_hw_adtim,
                                    uint16_t             data) {
    p_hw_adtim->dtuar = data;

    return AM_TRUE;
}

/**
 * \brief 设置死区时间下基准值
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] data       : 设定值
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_setdtda(amhw_hc32_adtim_t *p_hw_adtim,
                                    uint16_t data) {
    p_hw_adtim->dtdar = data;

    return AM_TRUE;
}

/**
 * \brief 配置死区时间功能
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] enable     : 死区功能使能（AM_FALSE或AM_TRUE）
 * \param[in] equal      : DTDAR的值和DTUAR的值自动相等使能（AM_FALSE或AM_TRUE）
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_cfgdt(amhw_hc32_adtim_t *p_hw_adtim,
                                  am_bool_t            enable,
                                  am_bool_t            equal) {

    p_hw_adtim->dconr = (p_hw_adtim->dconr &(~(1ul << 0))) |
                        (enable << 0);

    p_hw_adtim->dconr = (p_hw_adtim->dconr &(~(1ul << 8))) |
                        (equal << 8);

    return AM_TRUE;
}

/**
 * \brief 配置中断
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] type       : amhw_hc32_adtim_irq_type_t中断类型枚举量
 * \param[in] equal      : 相应中断使能（AM_FALSE或AM_TRUE）
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_cfgirq(amhw_hc32_adtim_t         *p_hw_adtim,
                                   amhw_hc32_adtim_irq_type_t type,
                                   am_bool_t                    enable) {
    if(enable == AM_TRUE) {
        p_hw_adtim->iconr |= (1ul << type);
    } else {
        p_hw_adtim->iconr &= ~(1ul << type);
    }

    return AM_TRUE;
}

/**
 * \brief 获取中断标志
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] type       : amhw_hc32_adtim_irq_type_t中断类型枚举量
 *
 * \return AM_FALSE:标志无效
 *         AM_TRUE :标志有效
 */
am_static_inline
am_bool_t amhw_hc32_adtim_getirqflag(amhw_hc32_adtim_t         *p_hw_adtim,
                                       amhw_hc32_adtim_irq_type_t type) {
    return ((p_hw_adtim->ifr >> type) & 1ul) ? AM_TRUE : AM_FALSE;
}

/**
 * \brief 清除中断标志
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] type       : amhw_hc32_adtim_irq_type_t中断类型枚举量
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearirqflag(amhw_hc32_adtim_t         *p_hw_adtim,
                                         amhw_hc32_adtim_irq_type_t type) {
    p_hw_adtim->iclr &= ~(1ul << type);

    return AM_TRUE;
}

/**
 * \brief 清除所有中断标志
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_clearallirqflag(amhw_hc32_adtim_t *p_hw_adtim) {

    p_hw_adtim->iclr = 0;

    return AM_TRUE;
}

/**
 * \brief Z相输入屏蔽设置
 *
 * \param[in] p_hw_adtim : 指向ADTIM定时器寄存器块的指针
 * \param[in] p_cfg      : 指向Z相输入屏蔽功能配置结构体的指针
 *
 * \return AM_FALSE:设置失败
 *         AM_TRUE :设置成功
 */
am_static_inline
am_bool_t amhw_hc32_adtim_cfgzmask(amhw_hc32_adtim_t           *p_hw_adtim,
                                     amhw_hc32_adtim_zmask_cfg_t *p_cfg) {
    if(p_cfg == NULL) {
        return AM_FALSE;
    }

    p_hw_adtim->gconr = (p_hw_adtim->gconr & (~(3ul << 18))) |
                        (p_cfg->zmask_cycle << 18);

    p_hw_adtim->gconr = (p_hw_adtim->gconr & (~(1ul << 17))) |
                        (p_cfg->fltposcntmask << 17);

    p_hw_adtim->gconr = (p_hw_adtim->gconr & (~(1ul << 16))) |
                        (p_cfg->fltrevcntmask << 16);

    return AM_TRUE;
}

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __AMHW_HC32_ADTIM_H */

/* end of file */
